АлогистикТест2/src/Documents/рфп_РапортРебросклей/рфп_РапортРебросклей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_РапортРебросклей</name>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <attributes>
    <name>ОбъемЩепы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_АналитикаЩепа/алк_АналитикаЩепа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_АналитикаЩепа</name>
  <enumValues>
    <name>Лущение</name>
  </enumValues>
  <enumValues>
    <name>Ребросклей</name>
  </enumValues>
  <enumValues>
    <name>ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводствоВозвратных</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПоддонов</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКотельной</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Утилизация</name>
  </enumValues>
  <enumValues>
    <name>Окорка</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/рфп_РапортРебросклей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРапортРебро, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рфп_РапортРебросклей.ОбъемЩепы КАК Объем,
		|	&Номенклатура,
		|	рфп_РапортРебросклей.ДатаСмены,
		|	рфп_РапортРебросклей.Смена,
		|	&Период,
		|	&ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.Ребросклей) КАК Аналитика
		|ИЗ
		|	Документ.рфп_РапортРебросклей КАК рфп_РапортРебросклей
		|ГДЕ
		|	рфп_РапортРебросклей.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРапортРебро.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРапортРебро.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Номенклатура", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();	
	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
		
#КонецЕсли
